## Converting dictionary into dataframe

In [1]:
people={
    "first":["Corey","Jane","John"],
    "last":["Schafer","Doe","Doe"],
    "email":["CoreyMSchafer@gmail.com","JaneDoe@gmail.com","JohnDoe@gmail.com"]
}

In [2]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']

In [3]:
import pandas as pd

In [4]:
df1=people

In [5]:
df1

{'first': ['Corey', 'Jane', 'John'],
 'last': ['Schafer', 'Doe', 'Doe'],
 'email': ['CoreyMSchafer@gmail.com',
  'JaneDoe@gmail.com',
  'JohnDoe@gmail.com']}

In [6]:
df=pd.DataFrame(people)

In [7]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

## ________

#

In [8]:
#passing list of column name into dataframe

df[['last','email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@gmail.com
2      Doe        JohnDoe@gmail.com

In [9]:
df['first'].dtype

dtype('O')

In [10]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [11]:
# evabe hobe nah

df.rows

AttributeError: 'DataFrame' object has no attribute 'rows'

## row dekhar jonno

In [ ]:
#for single row

df.iloc[0]

In [ ]:
# for multiple row

# kintu ei system e dekhabe 1st row er 2nd column


df.iloc[0,1]

In [ ]:
#  kintu dekha jacche eta series akare show korteche
#  full dataframe paite r ekta xtra [] dite hbe


df.iloc[[0,1]]

In [ ]:
df.iloc[[0,1],2]

#

In [ ]:
#  iloc er same

df.loc[0]

In [ ]:
#  kintu ekhane iloc er specific column er value dekhay nah


df.loc[0,1]

In [ ]:
df.loc[[0,1]]

In [ ]:
#  iloc er moto dekhay nah


df.loc[[0,1],2]

In [ ]:
#  specific column r value dekhte


df.loc[[0,1],'email']

In [ ]:

df.loc[[0,1],['email','last']]

#

##  Set,Reset,Use of Indexes

In [ ]:
df.set_index('email')

In [ ]:
#  kintu 'email' index hisebe set hoy nai

df

In [ ]:
df.index

In [ ]:
df1=df.copy()

In [ ]:
#  'email' k index hisebe set korar jonno


df1.set_index('email',inplace=True)

In [ ]:
df1

In [ ]:
df1.index

In [ ]:
#df.drop(['level_0','index'],axis=1,inplace=True)

In [ ]:
df1.loc['CoreyMSchafer@gmail.com','last']

In [ ]:
df1.loc['CoreyMSchafer@gmail.com']

###  new index set kore abar agerta index hisebe set korte

In [ ]:
df1.reset_index(inplace=True)

In [ ]:
df1.index

 #

#  Filtering

In [ ]:
filt=(df['last']=='Doe')
filt

In [ ]:
df[filt]

In [ ]:
df.loc[filt]

In [ ]:
 df.loc[filt,'email']

In [ ]:
 filt1=(df['last']=='Doe') & (df['first']=='John')

In [ ]:
filt1

In [ ]:
df[filt1]

In [ ]:
df[filt1].email

In [ ]:
df[filt1,'email']

In [ ]:
df.loc[filt1,'email']

#

#  Updating Rows & Columns Data

#

## Updating column name

In [ ]:
df.columns

In [ ]:
#  changing column name (normal merhod)

df.columns=['first_name','last_name','email']
df

In [ ]:
#  column name uppercase


df.columns=[x.upper() for x in df.columns]
df

In [ ]:
# removing the undrscore from column name


df.columns=df.columns.str.replace('_',' ')
df

In [ ]:
# column name uppercase


df.columns=[x.lower() for x in df.columns]
df


##  renaming specific columns   (  best method )

In [ ]:
df.rename(columns={'first name':'first','last name':'last'},inplace=True)
df

In [ ]:
#  changing row values

df.loc[2]=['John','Smith','JohnSmith@gmail.com']
df

In [ ]:
#  changing specific row value


df.loc[2,['last','email']]=['Doe','JohnDoe@gmail.com']

In [ ]:
df

In [12]:
#  changing specific row value using filter


filt=(df['email']=='JohnDoe@gmail.com')

In [13]:
df[filt]

  first last              email
2  John  Doe  JohnDoe@gmail.com

In [14]:
df[filt]['last'] ='Smith'

D:\python\anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
# hoy nah


df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [16]:
 #  loc use korl hbe
    
    
df.loc[filt,['last']] = 'Smith' 
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John    Smith        JohnDoe@gmail.com

In [17]:
#  chaing values for multiple rows
#  changing rows into lower case


df['email']=df['email'].str.upper()
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@GMAIL.COM
2   John    Smith        JOHNDOE@GMAIL.COM

In [18]:
#  using apply & lambda

df['email']=df['email'].apply(lambda x : x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

### apply => series
### applymap => dataframe
### map =>  series ( subsitute value using dictionary)
### replace => removing the limitation of  'map'

In [19]:
#  apply..
#..works on df / series object

df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [20]:
#  apply usin function


def update_email(email):
    return email.upper()

In [21]:
df['email']=df['email'].apply(update_email)
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@GMAIL.COM
2   John    Smith        JOHNDOE@GMAIL.COM

In [22]:
#  using apply & lambda

df['email']=df['email'].apply(lambda x : x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [23]:
#  show how many rows in a column

df.apply(len)

first    3
last     3
email    3
dtype: int64

#

###  apply map only works on data frame
###  as apply can not work on dataframe properly....it works on series

In [24]:
#  applymap

In [25]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [26]:
df.applymap(str.upper)

   first     last                    email
0  COREY  SCHAFER  COREYMSCHAFER@GMAIL.COM
1   JANE      DOE        JANEDOE@GMAIL.COM
2   JOHN    SMITH        JOHNDOE@GMAIL.COM

In [27]:
#  map

In [28]:
df['first'].map({'Corey':'chris','Jane':'mary'})

0    chris
1     mary
2      NaN
Name: first, dtype: object

In [29]:
#  here to remove this " NAN "  value problem,,,, we have to use " replace "

In [30]:
df['first'].replace({'Corey':'chris','Jane':'mary'})

0    chris
1     mary
2     John
Name: first, dtype: object

In [31]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

#

#  Adding or Removing Rows or Columns

## adding / splittng two columns

In [32]:
df5=df.copy()
df5

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [33]:
df5['first']+ ' ' + df5['last']

0    Corey Schafer
1         Jane Doe
2       John Smith
dtype: object

In [34]:
df5['full_name']=df5['first']+ ' ' + df5['last']
df5

   first     last                    email      full_name
0  Corey  Schafer  coreymschafer@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John    Smith        johndoe@gmail.com     John Smith

In [35]:
df5.drop(columns=['first', 'last'], inplace=True)

In [36]:
df5

                     email      full_name
0  coreymschafer@gmail.com  Corey Schafer
1        janedoe@gmail.com       Jane Doe
2        johndoe@gmail.com     John Smith

###  splitting  a colums value

In [37]:
df5['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2       [John, Smith]
Name: full_name, dtype: object

In [38]:
df5['full_name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John    Smith

In [39]:
df5[['first','last']]=df5['full_name'].str.split(' ',expand=True)

In [40]:
df5

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        johndoe@gmail.com     John Smith   John    Smith

#

## adding / removing rows

In [41]:
df4=df.copy()
df4.append({'first':'Tony'},ignore_index=True)

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com
3   Tony      NaN                      NaN

## to add a new dataframe into the dataframe

In [42]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df3 = pd.DataFrame(people)

In [43]:
df3

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [44]:
df4=df.append(df3,ignore_index=True,sort=False)

In [45]:
df4

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com
3   Tony    Stark       IronMan@avenge.com
4  Steve   Rogers           Cap@avenge.com

###  removing a row using ' drop '

In [46]:
df4.drop(index=4)

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com
3   Tony    Stark       IronMan@avenge.com

In [47]:
filt=(df['last']=='Doe')

In [48]:
df4.drop(index=df[filt].index)

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
2   John    Smith        johndoe@gmail.com
3   Tony    Stark       IronMan@avenge.com
4  Steve   Rogers           Cap@avenge.com

In [49]:
df4

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com
3   Tony    Stark       IronMan@avenge.com
4  Steve   Rogers           Cap@avenge.com

In [50]:
#  extra


df['last'].replace({'Smith':'Doe'},inplace=True)

#

#  Sorting

In [51]:
df6=df.copy()

In [52]:
df6.sort_values(by='last')

   first     last                    email
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        johndoe@gmail.com
0  Corey  Schafer  coreymschafer@gmail.com

###  sort over multiple column

###   sort by last column... if value same then sort according to first column

In [53]:
df6.sort_values(by=['last', 'first'], ascending=False)

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
2   John      Doe        johndoe@gmail.com
1   Jane      Doe        janedoe@gmail.com

In [54]:
df6.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)

In [55]:
df6

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        johndoe@gmail.com

In [56]:
people6 = {
    'first': ['Corey', 'Jane', 'John', 'Adam'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', 'A@email.com']
}

In [57]:
df6 = pd.DataFrame(people6)

In [58]:
df6

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [59]:
df6.sort_values(by=['last', 'first'], ascending=[False, True],inplace=True)

In [60]:
df6

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

###  sort by index

In [61]:
df6.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [62]:
df6['last'].sort_values()

3        Doe
1        Doe
2        Doe
0    Schafer
Name: last, dtype: object